src/SteadyState/setups.orig/common/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    "(ground|top)"
    {
       type             fixedFluxPressure;
       rho              rhok;
       value            uniform 0;
    }

    inlet
    {
        type            zeroGradient;
    }
    
    outlet
    {
    	type            zeroGradient;
    }
    
    
    sides
    {    
        type            empty;
    }
}


// ************************************************************************* //
