src/SteadyState/setups.orig/common/system/include/EPMControl
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

const scalar startiteration = 0;
const scalar& Hr = 30;
const scalar& cp = 1.005e3;
const scalar& lmb = 2.25e6;
const scalar& psy = 66e-3;
const scalar& Rspec = 461.5;
const scalar& kappa = 0.4;
const scalar& bkgrdMoisture = 0;

// ************************************************************************* //
